{
  "job_title": "Full Stack Developer Intern",
  "company_name": "Clinikally (YC S22)",
  "location": "Remote",
  "date_posted": "6 hours ago",
  "job_description": "One of India's fastest growing consumer health startups Clinikally is looking for someone who has solid mobile engineering fundamentals, can help build winning cross-platform mobile apps and thrive amidst a dynamic team. This internship offers an excellent opportunity to gain hands-on experience in software fundamentals while contributing to a first of its kind e-commerce and telehealth platform focused on dermatology (→ with potential full-time upon completion).\nResponsibilities \nBuild high quality mobile apps from scratch in a lean team for iOS and Android\nCollaborate with senior developers to implement responsive and accessible designs across mobile platform.\nParticipate in coding, testing, and debugging of mobile applications\nLearn and apply best practices in front-end and mobile development\nDocument code and maintain technical documentation\nUnderstanding of RESTful APIs and how to integrate them in mobile apps\nSeamless communication and ownership are musts!\nRequirements\nCurrently pursuing a degree in Computer Science, Mobile App Development, or a related field\nStrong foundation in HTML, CSS, and JavaScript\nFamiliarity with modern front-end frameworks (e.g., React, Vue.js, or Angular)\nPrior internships in mobile engineering is a must\nPreviously built high quality mobile apps in production-grade environments\nGood understanding of native Android/iOS development - writing work bridges, etc.\nCan build high quality UI and UX flows\nWhat We Offer\nHands-on experience in real-world development environments & production-ready projects\nMentorship from experienced developers specializing in all technologies\nExposure to both e-commerce and healthcare industries\nOpportunity to work on mobile technologies\nFlexible work hours to accommodate your academic schedule\nPotential for full-time employment upon successful completion of the internship, along with bonus on release.\nDuration: [\n    6-9 months\n  ]\nTo apply, please submit your resume, a note explaining your interest in this position, and any relevant portfolio or project examples (including any mobile apps you've worked on, even if they're academic projects)."
}